t21/Walnut_X/Packages/.cache/Keil.STM32F1xx_DFP.2.1.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32F1xx_DFP</name>
  <description>STMicroelectronics STM32F1 Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="2.1.0" date="2016-04-14">
      Updated CMSIS drivers:
      - EMAC: 
      -- Improved robustness by function checking that driver is powered (EMAC_FLAG_POWER)
      - CAN:
      -- Corrected functionality when only one CAN controller is used
      -- Corrected pin remap configuration for CAN2 port pins
      -- Corrected functionality when NULL pointer is provided for one or both signal callbacks in Initialize function
      - USB Device:
      -- Corrected Isochronous transfer
      -- Corrected IN Endpoint FIFO flush procedure
      - USB Host:
      -- Removed interrupt priority handling
      -- Corrected multiple packet sending
      -- Corrected PowerControl function for unconditional Power Off
      - USART:
      -- Corrected Peripheral Reset and Clock enable/disable (check if peripheral is available on selected device)
      -- Corrected CTS handling and added signal CTS change event.
      - SPI:
      -- Corrected Peripheral Reset and Clock enable/disable (check if peripheral is available on selected device)
      -- Corrected Bus Speed configuration
      -- Corrected 8bit/16bit Data register access, regarding the Data frame size
      -I2C: 
      -- Corrected invalid __I2C_DMA field in I2C_DMA_TxEvent and I2C_DMA_RxEvent functions
      Updated/added examples:
      - Added examples using Network DualStack (IPv4/IPv6) Middleware targeting MCBSTM32C (Keil.MDK-Middleware.7.0.0.pack required)
      - Updated emWin examples to emWin V5.32
      - Updated CAN examples
      - Updated USB Host examples
      - Updated USB Device CDC ACM VirtualCOM examples
      Updated RTE_Device.h: Corrected USART Pin configuration
      Added trace configuration to the debug description and updated Quick Start Guide
    </release>
    <release version="2.0.0" date="2015-10-09">
      Requires MDK-Middleware Version 6.5.0 and CMSIS Version 4.4.0
      Updated CMSIS-Drivers
      - CMSIS-Driver API V2.0 compliant
      - Added CMSIS-Driver for CAN
      Updated Examples:
      - Updated Board Support and all examples for MCBSTM32C and MCBSTM32E
      - Added examples for CAN
    </release>
    <release version="1.1.0" date="2015-02-13">
      Examples: Pack Selection for fixed version CMSIS 3.20.4 and MDK-Middleware 5.1.6
      Updated stm32f10x.h (xl-density: Added missing "STM32F10X_XL" for "RCC_AHBENR_DMA2EN" and "RCC_APB1ENR_USBEN")
    </release>
    <release version="1.0.5" date="2014-03-14">
      Component updated: Device:StdPeriph Drivers:Framework Version:3.5.1 - added file misc.c
    </release>
    <release version="1.0.4" date="2014-02-20">
      Added STM Peripheral Driver Library V1.3.0
    </release>
    <release version="1.0.3">
      Updated DMA driver (DMA2 peripheral added to build when HD, XL, HD_VL or CL device is used)
      USB Device driver update: multiple packet read, EP0 unconfiguration
      Updated SPI driver (IRQ handling corrected)
    </release>
    <release version="1.0.2">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.1">
      Added devices
    </release>
    <release version="1.0.0">
      First Release version of STM32F1 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F1</keyword>
    <keyword>STM32</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="STM32F1 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
      <debugvars configfile="Debug/STM32F1xx.dbgconf" versio="1.0.0">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var DbgMCU_CR      = 0x00000007;   // Debug MCU Configuration Register
      </debugvars>

      <sequences>

        <!-- Override for Pre-Defined DebugCoreStart Sequence -->
        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR

            // Device Specific Debug Setup
            Write32(0xE0042004, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
          </block>
        </sequence>

        <!-- Override for Pre-Defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
            </block>
          </control>

        </sequence>

        <!-- User-Defined EnableTraceSWO Sequence -->
        <sequence name="EnableTraceSWO">
          <block>
            __var dbgmcu_val    = 0;                                                // DBGMCU_CR Value

            dbgmcu_val  = Read32(0xE0042004) &amp; (~0xE0);                         // Read DBGMCU_CR and clear trace setup
            dbgmcu_val |= (1 &lt;&lt; 5);                                           // Trace I/O Enable + Trace Mode Asynchronous

            Write32(0xE0042004, dbgmcu_val);                                        // Write DBGMCU_CR: Trace Settings
          </block>
        </sequence>

