t21/Walnut_X/Packages/.cache/Keil.STM32F1xx_DFP.2.1.0.pdsc
      <!-- *************************  Device 'STM32F100VC'  ***************************** -->
      <device Dname="STM32F100VC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD/STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"/>
        <feature type="SPI"           n="3"       m="12000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="5"       m="4500000"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F100VD'  ***************************** -->
      <device Dname="STM32F100VD">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD/STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"/>
        <feature type="SPI"           n="3"       m="12000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="5"       m="4500000"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F100VE'  ***************************** -->
      <device Dname="STM32F100VE">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD/STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="16"/>
        <feature type="IOs"           n="80"/>
        <feature type="SPI"           n="3"       m="12000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="5"       m="4500000"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F100ZC'  ***************************** -->
      <device Dname="STM32F100ZC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD/STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="16"/>
        <feature type="IOs"           n="112"/>
        <feature type="SPI"           n="3"       m="12000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="5"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F100ZD'  ***************************** -->
      <device Dname="STM32F100ZD">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD/STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="112"/>
        <feature type="SPI"           n="3"       m="12000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="5"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F100ZE'  ***************************** -->
      <device Dname="STM32F100ZE">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD/STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="112"/>
        <feature type="SPI"           n="3"       m="12000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="5"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F101'  **************************** -->
      <subFamily DsubFamily="STM32F101">
      
