t21/Walnut_X/Packages/.cache/Keil.STM32F1xx_DFP.2.1.0.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKP" Cversion="3.5.0" condition="STM32F1xx STDPERIPH">
      <description>Backup registers (BKP) driver for STM32F10x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_bkp.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_bkp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Controller area network (CAN) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_can.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_can.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CEC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Consumer electronics control controller (CEC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CEC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_cec.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_cec.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH ">
      <description>CRC calculation unit (CRC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_crc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_crc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Digital-to-analog converter (DAC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_dac.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_dac.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="3.5.0" condition="STM32F1xx STDPERIPH">
      <description>MCU debug component (DBGMCU) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBGMCU
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_dbgmcu.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_dbgmcu.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>DMA controller (DMA) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_dma.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_dma.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EXTI" Cversion="3.5.0" condition="STM32F1xx STDPERIPH">
      <description>External interrupt/event controller (EXTI) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_exti.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_exti.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Flash" Cversion="3.5.0" condition="STM32F1xx STDPERIPH">
      <description>Embedded Flash memory driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_flash.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_flash.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FSMC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Flexible Static Memory Controller (FSMC) driver for STM32F11x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FSMC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_fsmc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_fsmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>General-purpose I/O (GPIO) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_gpio.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_gpio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Inter-integrated circuit (I2C) interface driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_i2c.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_i2c.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDG" Cversion="3.5.0" condition="STM32F1xx STDPERIPH ">
      <description>Independent watchdog (IWDG) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_iwdg.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_iwdg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Power controller (PWR) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_pwr.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_pwr.c"/>
      </files>
    </component>

