t21/Walnut_X/Packages/.cache/Keil.STM32F1xx_DFP.2.1.0.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH">
      <description>Reset and clock control (RCC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_rcc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_rcc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="3.5.0" condition="STM32F1xx STDPERIPH">
      <description>Real-time clock (RTC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_rtc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_rtc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Secure digital (SDIO) interface driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_sdio.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_sdio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Serial peripheral interface (SPI) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_spi.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_spi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIM" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Timers (TIM) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_tim.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_tim.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_usart.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_usart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG" Cversion="3.5.0" condition="STM32F1xx STDPERIPH RCC">
      <description>Window watchdog (WWDG) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/stm32f10x_wwdg.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/stm32f10x_wwdg.c"/>
      </files>
    </component>

    <!-- END: STMicroelectronics Standard Peripherals Drivers -->

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.2" condition="STM32F1xx CMSIS">
      <description>GPIO driver used by RTE Drivers for STM32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_STM32F10x.h"/>
        <file category="source" name="RTE_Driver/GPIO_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="DMA" Cversion="1.2" condition="STM32F1xx CMSIS">
      <description>DMA driver used by RTE Drivers for STM32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver/DMA_STM32F10x.h"/>
        <file category="source" name="RTE_Driver/DMA_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.0" Cversion="1.2" condition="STM32F1xx CMSIS GPIO">
      <description>CAN Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1" Cversion="2.2" condition="STM32F1xx CMSIS GPIO DMA">
      <description>SPI Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="2.2" condition="STM32F1xx CMSIS GPIO DMA">
      <description>UART Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver UART4  */
        #define RTE_Drivers_USART5              /* Driver UART5  */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USART_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="2.1" condition="STM32F1xx CMSIS GPIO DMA">
      <description>I2C Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="2.0" condition="STM32F1xx CMSIS GPIO DMA">
      <description>MCI Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.1" condition="STM32F107 CMSIS GPIO">
      <description>Ethernet MAC Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_STM32F10x.c"/>
      </files>
    </component>

